#pragma once
#include <iostream>

#include "Renderer.h"
#include "Timer.h"


class Game
{
private:
	//　タイマー
	Timer m_Timer;

public:
	// ==================================================================
	// コンストラクタ・デストラクタ
	// ==================================================================
	Game(); // コンストラクタ
	~Game(); // デストラクタ

	// ==================================================================
	// ライフサイクル
	// ==================================================================
	void Init(); // 初期化
	void Update(); // 更新
	void Draw(); // 描画
	void Uninit(); // 終了処理

	// ===================================================================
	// グローバルアクセス用の静的関数
	// ===================================================================

	// デルタタイム取得
	static float GetDeltaTime();

	// 経過時間取得
	static float GetTotalTime();

	// FPS取得
	static float GetFPS();

};
